dating/app/controllers/relationships_controller.rb

def create
  @user = User.find(params[:relationship][:match_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "21"]]

def destroy
  @user = Relationship.find(params[:id]).match
  @current_user = User.find session[:user_id]
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = 1 AND "relationships"."match_id" = 21 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 21 LIMIT 1