dating/app/controllers/users_controller.rb

def update_status
	@user_for_status = User.where(:id => session[:user_id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]