dating/app/controllers/users_controller.rb

def show
	# currently doesn't render if the user is not signed in. needs a before filter.
	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

def create
	@user = User.new(params[:user])
	@user_status = UserInfo.new
	@user_status.user_id = @user.id
	@user_status.status = "You have no status message."
	if @user.save && @user_status.save
---
INSERT INTO "user_infos" ("about", "created_at", "dob", "fname", "gender", "interested_in", "last_visit", "lname", "location", "looking_for", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("about", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "dob", "email", "gender", "location", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def home
	@user = User.find(session[:user_id])
	@user_for_status = UserInfo.where(:user_id => session[:user_id]).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = 1 LIMIT 1

def update_status
	@user_for_status = UserInfo.where(:user_id => session[:user_id]).first
	if @user_for_status.nil?
		@user_for_status = UserInfo.new(:user_id => session[:user_id], :status => "You still have no status message.")
	end
	 @user_for_status.status = params[:user_for_status][:status]
	 if @user_for_status.save
	 	TimelineUpdates.create(:user_id => session[:user_id], :message => " posted new status message: #{params[:user_for_status][:status]}.")
---
SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = 1 LIMIT 1
INSERT INTO "user_infos" ("about", "created_at", "dob", "fname", "gender", "interested_in", "last_visit", "lname", "location", "looking_for", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "user_infos" SET "status" = 'hahha', "updated_at" = '2012-03-13 00:27:28.458345' WHERE "user_infos"."id" = 1
UPDATE "users" SET "status" = 'kkkkk', "updated_at" = '2012-03-15 15:51:44.085759' WHERE "users"."id" = 1
INSERT INTO "timeline_updates" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 13 Mar 2012 02:42:50 UTC +00:00], ["message", " posted new status message: Hma."], ["updated_at", Tue, 13 Mar 2012 02:42:50 UTC +00:00], ["user_id", 7]]

def update
	@user = User.find(params[:id])
	if @user.update_attributes(params[:user])
		TimelineUpdates.new(:user_id => session[:user_id], :message => " updated his/her profile").save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "avatar_file_name" = '6cbaa7a90e13030c633db0531d5d6222_9704688.jpg', "avatar_content_type" = 'image/jpeg', "avatar_file_size" = 193007, "avatar_updated_at" = '2012-03-12 22:45:52.067550', "gender" = 'Male', "location" = 'haha', "password_digest" = '$2a$10$OK.EmRo/XwmENWJVMz6FAusAflTj6kPGyuwYe7gGRtIvOmSvGToCu', "dob" = '1953-04-01', "updated_at" = '2012-03-12 22:45:52.734831' WHERE "users"."id" = 1
INSERT INTO "timeline_updates" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 13 Mar 2012 03:18:08 UTC +00:00], ["message", " updated his/her profile"], ["updated_at", Tue, 13 Mar 2012 03:18:08 UTC +00:00], ["user_id", 1]]

def matches
	@title = 'Matches'
	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]

def interested
	@title = 'Interested Users'
	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]