app/views/users/_add_match.html.erb

<%= form_for User.find(session[:user_id]).relationships.
                          build(:match_id => @user.id) do |f| %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = 1 AND "relationships"."match_id" = 79 LIMIT 1