app/views/users/_remove_match.html.erb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = 1 AND "relationships"."match_id" = 50 LIMIT 1
---
<%= form_for User.find(session[:user_id]).relationships.find_by_match_id(user),
             :html => { :method => :delete } do |f| %>