app/views/users/_user_interests.html.erb

  <% unless @user.interests.nil? %>
    <% @user.interests.each do |interest| %>
---
SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = 1