app/views/users/_user.html.erb

<% user = @user if user.nil? %>
<% profile = user == User.find(session[:user_id]) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]