app/views/users/show.html.erb

    <h3>Your Latest Tweet:</h3>
    <%= Twitter.user_timeline(@user.twitter).first.text %>
---
SELECT "users".* FROM "users"