app/views/shared/_match_stats.html.erb

  <strong>
    <%= @user.interested_users.count %>
---
SELECT "users".* FROM "users"