app/views/timeline/_list.html.erb

<% TimelineUpdates.find(:all, :order => "created_at DESC").each do |update| %>
	<% if !Relationship.where(:user_id => session[:user_id], :match_id => update.user_id).first.nil? && k < 20 %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = 7 AND "relationships"."match_id" = 7 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]