app/views/interests/_random_interests.html.erb

<ul class="interests">
  <% Interest.random(10).each do |interest| %>
---
SELECT interests.id FROM "interests"