app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @user = User.find(session[:user_id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 101]]
UPDATE "messages" SET "read" = 't', "updated_at" = '2012-03-14 19:16:57.935906' WHERE "messages"."id" = 50
---
  def show
    @message = Message.find(params[:id])
    @user = User.find(session[:user_id])

    if (!@message.read) then
      @message.read = true
      @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO "messages" ("created_at", "message", "read", "recipient_id", "sender_id", "time", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."sender_id" = 1
---
  def outbox
    #@user = User.find(session[:user_id])
    #@messages = @user.messages
    @messages = Message.where(:sender_id => session[:user_id])