app/controllers/relationships_controller.rb

def create
  @user = User.find(params[:relationship][:match_id])
  @current_user = User.find session[:user_id]

  @current_user.add_match! @user
  TimelineUpdates.new(:user_id => session[:user_id], :message => " added #{@user.name} as his/her match.").save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "79"]]
INSERT INTO "relationships" ("created_at", "match_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 14 Mar 2012 18:01:29 UTC +00:00], ["match_id", 79], ["updated_at", Wed, 14 Mar 2012 18:01:29 UTC +00:00], ["user_id", 1]]
INSERT INTO "timeline_updates" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 14 Mar 2012 18:01:29 UTC +00:00], ["message", " added Laura White as his/her match."], ["updated_at", Wed, 14 Mar 2012 18:01:29 UTC +00:00], ["user_id", 1]]