app/controllers/users_controller.rb

def home
	@user = User.find(session[:user_id])
	@user_for_status = UserInfo.where(:user_id => session[:user_id]).first
	if @user_for_status.nil?
		@user_for_status = UserInfo.new(:user_id => session[:user_id], :status => "You still have no status message")
		@status = @user_for_status.status
	else
		@status = @user_for_status.status
	end
	@user_for_status.save
---
SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = 1 LIMIT 1
INSERT INTO "user_infos" ("about", "created_at", "dob", "fname", "gender", "interested_in", "last_visit", "lname", "location", "looking_for", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def update_status
	@user_for_status = UserInfo.where(:user_id => session[:user_id]).first
	if @user_for_status.nil?
		@user_for_status = UserInfo.new(:user_id => session[:user_id])
	end
	 @user_for_status.status = params[:user_for_status][:status]
	 if @user_for_status.save
---
SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = 1 LIMIT 1
INSERT INTO "user_infos" ("about", "created_at", "dob", "fname", "gender", "interested_in", "last_visit", "lname", "location", "looking_for", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "user_infos" SET "status" = 'hi', "updated_at" = '2012-03-14 02:44:32.893269' WHERE "user_infos"."id" = 1