app/controllers/users_controller.rb

def index
  @title = "All users"
  @users = User.all
  @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

def create
	@user = User.new(params[:user])
	if @user.save
---
INSERT INTO "users" ("about", "avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "created_at", "dob", "email", "gender", "location", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def home
  @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

def update_status
  @current_user = User.find(session[:user_id])

	@user_for_status = User.find(session[:user_id])
	 if @user_for_status && @user_for_status.update_attribute(:status, params[:user_for_status][:status])
	 	TimelineUpdates.create(:user_id => @user_for_status.id, :message => " posted new status message: #{params[:user_for_status][:status]}.")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "status" = 'alalal', "updated_at" = '2012-03-16 15:37:20.947104' WHERE "users"."id" = 1
INSERT INTO "timeline_updates" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)

def edit
  @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

def update
  @current_user = User.find(session[:user_id])

	@user = User.find(params[:id])
	if @user.update_attributes(params[:user])
		TimelineUpdates.new(:user_id => session[:user_id], :message => " updated his/her profile").save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "avatar_file_name" = 'fancydress.png', "avatar_content_type" = 'image/png', "avatar_file_size" = 33174, "avatar_updated_at" = '2012-03-14 02:46:04.183853', "gender" = 'male', "location" = 'aberdeen', "about" = 'HI IM JOE <3
INSERT INTO "timeline_updates" ("created_at", "message", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Wed, 14 Mar 2012 02:46:09 UTC +00:00], ["message", " updated his/her profile"], ["updated_at", Wed, 14 Mar 2012 02:46:09 UTC +00:00], ["user_id", 1]]

def matches
  @title = 'Matches'

  @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

def interested
  @title = 'Interested Users'

  @current_user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def find_matches
    @current_user = User.find(session[:user_id])
    @user = @current_user

    @title = "Suggested matches for #{@current_user.name}"

    # don't include the current user or existing matches in the possible matches
    @users = (User.all - [@current_user]) - @current_user.matches

    # associate each user with the number of shared interests they have with the current user
    users_shared_interests = {}
    @users.each do |user|
      users_shared_interests[user.id] = @current_user.shared_interests(user).size
---
SELECT 1 FROM "users" WHERE "users"."username" = '' LIMIT 1
SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = 1